test/load-tests/carga-100.yml
# Teste de Software/n2-analytics-social/test/load-tests/scenario.yml

## carga heavyload

config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 100

scenarios:
  - name: "Cenário 100 usuários"
    flow:
      - get:
          url: "/posts"
      - get:
          url: "/users"
      - get:
          url: "/comments" ## add agora