test/load-tests/carga-50.yml
# Teste de Software/n2-analytics-social/test/load-tests/scenario.yml

## carga moderada

config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 50

scenarios:
  - name: "Cenário 50 usuários"
    flow:
      - get:
          url: "/posts"
      - get:
          url: "/users"
      - get:
          url: "/comments"