test/load-tests/scenario.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30 # duração total do teste
      arrivalRate: 20 # 20 usuários virtuais por segundo
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Teste de carga básico - GET /posts"
    flow:
      - get:
          url: "/posts"